PERFORMANCE/perf-test.yml
config:
  target: "https://testpages.eviltester.com"
  
  # Enable the Playwright engine
  engines:
    playwright: {
      trace: {
        enabled: true
      }
    }

  # Link to the script we created in Step 3
  processor: "./cart-flow.js"
  # Add the ensure check here:
  plugins:
    ensure:
      conditions:
      # This checks the custom metric we created in cart-flow.js
        - expression: "metric_add_to_cart.p95 < 3000"
        - expression: "vusers.failed == 0"
        - expression: "metric_page_load.p95 < 4000"
        - expression: "vusers.completed >= 90"

  # Define the Load Pattern
  phases:
    - duration: 30       # Run the test for 30 seconds
      arrivalRate: 5     # 5 new users arrive every second
      maxVusers: 100     # Cap at 100 concurrent users
      name: "Ramping up to 100 concurrent users"




scenarios:
  - engine: playwright
    testFunction: "addToCartFlow"